
altynasyq_kaz = """Ырысбек Мәуіт ағайдан 3-4-5 сынып оқушыларына жаңа жоба!

"Алтын Асық" челленджі - 3-5 сыныптар үшін математика-логикадан жарыс.

Жүлде қоры: 40 000 000 теңге
Бас жүлде — Сингапурға сапар

Тіркелу уақыты: 9 сәуір – 9 мамыр аралығы
Өтетін уақыты: 10–14 мамыр 2025 жыл
Қатысу ақысы: 5000 теңге
Финал: 1 маусым 2025 жылы Астана қаласында офлайн форматта өтеді.

Толық ақпарат пен тіркелу:
https://info.zerdeli.app/altynasyq"""


altynasyq_rus = """Для учеников 3-4-5 классов новый проект от Ырысбека Мәуіта!

"Алтын асық" челлендж - соревнование по математике и логике для учащихся 3-5 классов.

Призовой фонд: 40 000 000 тенге
Главный приз — поездка в Сингапур

Период регистрации: с 9 апреля по 9 мая 
Дата проведения: с 10 по 14 мая 2025 года
Стоимость участия: 5000 тенге 
Финал: 1 июня 2025 года, в офлайн-формате в городе Астана.

Полная информация и регистрация: https://info.zerdeli.app/altynasyq"""

answer = {
    "greeting": {
        "kz": "👋 Сәлем! Қош келдіңіз!",
        "ru": "👋 Привет! Добро пожаловать!"
    },
    "course": {
        "kz": "📚 Курс алғым келеді",
        "ru": "📚 Я хочу пройти курс"
    },
    "altynasyq": {
        "kz": "🏆 \"Алтын Асық\" челленджі",
        "ru": "🏆 Челлендж \"Алтын Асық\""
    },
    "altynasyq_info": {
        "kz": altynasyq_kaz,
        "ru": altynasyq_rus
    },
    "altynasyq_photo": {
        "kz": "app/images/alt.jpg",
        "ru": "app/images/alt.jpg"
    },

    "more_info": {
        "kz": "📄 Толығырақ ақпарат",
        "ru": "📄 Подробнее информация"
    },
    "back": {
        "kz": "🔙 Артқа",
        "ru": "🔙 Назад"
    },
    "ask_name": {
        "kz": "Атыңызды енгізіңіз:",
        "ru": "Введите ваше имя:"
    },
    "ask_region": {
        "kz": "Облысыңызды енгізіңіз:",
        "ru": "Введите вашу область:"
    },
    "ask_phone": {
        "kz": "Телефон нөміріңізді енгізіңіз:",
        "ru": "Введите ваш номер телефона:"
    },
    "thank_you": {
        "kz": "Рақмет! Ақпаратыңыз қабылданды ✅",
        "ru": "Спасибо! Ваша информация принята ✅"
    },
    "support": {
        "kz": "🛠 zerdeli.app бойынша техникалық сұрағым бар",
        "ru": "🛠 У меня технический вопрос на счет zerdeli.app"
    },
    "btn_how_to_register": {
        "kz": "📝 Қалай тіркелемін?",
        "ru": "📝 Как зарегистрироваться?"
    },
    "btn_how_to_view_certificate": {
        "kz": "📄 Сертификатты қалай көремін?",
        "ru": "📄 Как посмотреть сертификат?"
    },
    "choose": {
        "kz": "Сұрағыңызды таңдаңыз",
        "ru": "Выберите вопрос"
    },
    "frequently_asked": {
        "kz": "❓ Жиі қойылатын сұрақтар",
        "ru": "❓ Часто задаваемые вопросы"
    }
}


FAQ_TEXT_KAZ = """❓ 1. Қате сұрақтарға ұпай қосыла ма?
🟢 Иә, егер сұрақтың мазмұнында қате анықталса, қатысушыға ұпай қосылады.

❓ 2. Біз 3-деңгей екенін білмей қалдық немесе басталғанын ұмытып кетіппіз. Қайта тапсыруға мүмкіндік бар ма?
🔴 Өкінішке қарай, жоқ. Қайта тапсыру қарастырылмаған.

❓ 3. Әділ өтеді дегенге сенім жоқ. Кейбіреулерге ата-анасы немесе мұғалімі көмектесуі мүмкін. 2–3 минутта бәрін аяқтау мүмкін емес қой.
🟢 Финалда тек нақты білімі бар оқушылар ғана жеңіске жетеді. Сондықтан көмекке жүгінудің қажеті жоқ.

❓ 4. Қалған күндердің тапсырмалары орыс тіліне сауатты аударылса екен.
🟢 Иә, барлық тапсырмалар орыс тіліне сауатты аударылған.

"""

FAQ_TEXT_RUS = """❓ 1. Начисляются ли баллы за ошибочные вопросы?
🟢 Да, если в вопросе найдена ошибка, участнику начисляются баллы.

❓ 2. Мы не знали, что это был 3-й уровень, или забыли, что он начался. Можно ли пересдать?
🔴 К сожалению, нет. Повторная сдача не предусмотрена.

❓ 3. Это не совсем справедливо — кто-то, возможно, выполняет с помощью родителей или учителей. Заканчивают за 2–3 минуты.
🟢 В финале победят только те, у кого действительно есть знания. Поэтому нет смысла обращаться за помощью.

❓ 4. Хотелось бы, чтобы оставшиеся задания были грамотно переведены на русский язык.
🟢 Да, все задания грамотно переведены на русский язык.

"""